# Installed automatically by chezmoi apply via run_onchange_darwin-install-packages.sh.tmpl
# (re-runs whenever this file changes).

# Core CLI stack
brew "chezmoi"
brew "neovim"          # EDITOR; LazyVim config lives in dot_config/nvim
brew "mise"
brew "starship"
brew "atuin"
brew "fzf"
brew "zoxide"
brew "ripgrep"
brew "fd"
brew "gh"
brew "git-delta"
brew "lazygit"
brew "jq"
brew "tmux"
brew "htop"
brew "ncdu"            # disk usage TUI

# Dev tools
brew "direnv"
brew "httpie"
brew "hurl"
brew "pandoc"
brew "parallel"
brew "pipx"
brew "uv"
brew "mosh"
brew "lnav"
brew "lazydocker"
brew "lazysql"
brew "sk"
brew "television"
brew "worktrunk"
brew "resterm"
brew "xcodegen"
brew "ninja"
brew "pkg-config"
brew "tcl-tk"
brew "python-tk"

# Infra / k8s
brew "helm"
brew "kubespy"
brew "logcli"
# brew "plumber"  # FIXME: no valid formula/tap (batchcorp tap defunct). Restore with correct tap or drop.
brew "websocat"
brew "cloudflared"
cask "gcloud-cli"      # Google Cloud SDK: gcloud/gsutil/bq symlinked into bin; completion wired in dot_zshrc
cask "codex"           # OpenAI Codex CLI: https://github.com/openai/codex

# Third-party taps
brew "saulpw/vd/visidata"
brew "turbot/tap/steampipe"
brew "pkgxdev/made/pkgx"
brew "umputun/apps/revdiff"

# GUI apps
cask "keepassxc"
cask "orbstack"
cask "karabiner-elements"  # caps -> esc (tap) / hyper (hold); config in dot_config/karabiner
